using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace TextCraft.src.Table
{
    internal static class EntityModelTable
    {
        public static readonly Model model1 = new Model(
            new float[][]
            {
                // 右面 (x=0.16)
                new float[]{
                    0.16f, -1.7f, 0.16f, 0.0f, 1.0f, 0.0f,
                    0.16f, -1.7f, -0.16f, 1.0f, 1.0f, 0.0f,
                    0.16f, 0.2f, -0.16f, 1.0f, 0.0f, 0.0f,
                    0.16f, -1.7f, 0.16f, 0.0f, 1.0f, 0.0f,
                    0.16f, 0.2f, -0.16f, 1.0f, 0.0f, 0.0f,
                    0.16f, 0.2f, 0.16f, 0.0f, 0.0f, 0.0f,
                },
                // 左面 (x=-0.16)
                new float[]{
                    -0.16f, -1.7f, -0.16f, 0.0f, 1.0f, 0.0f,
                    -0.16f, -1.7f, 0.16f, 1.0f, 1.0f, 0.0f,
                    -0.16f, 0.2f, 0.16f, 1.0f, 0.0f, 0.0f,
                    -0.16f, -1.7f, -0.16f, 0.0f, 1.0f, 0.0f,
                    -0.16f, 0.2f, 0.16f, 1.0f, 0.0f, 0.0f,
                    -0.16f, 0.2f, -0.16f, 0.0f, 0.0f, 0.0f,
                },
                // 上面 (y=0.2)
                new float[]{
                    -0.16f, 0.2f, 0.16f, 0.0f, 0.0f, 0.0f,
                    0.16f, 0.2f, 0.16f, 1.0f, 0.0f, 0.0f,
                    0.16f, 0.2f, -0.16f, 1.0f, 1.0f, 0.0f,
                    -0.16f, 0.2f, 0.16f, 0.0f, 0.0f, 0.0f,
                    0.16f, 0.2f, -0.16f, 1.0f, 1.0f, 0.0f,
                    -0.16f, 0.2f, -0.16f, 0.0f, 1.0f, 0.0f,
                },
                // 下面 (y=-1.7)
                new float[]{
                    -0.16f, -1.7f, -0.16f, 1.0f, 0.0f, 0.0f,
                    0.16f, -1.7f, -0.16f, 0.0f, 0.0f, 0.0f,
                    0.16f, -1.7f, 0.16f, 0.0f, 1.0f, 0.0f,
                    -0.16f, -1.7f, -0.16f, 1.0f, 0.0f, 0.0f,
                    0.16f, -1.7f, 0.16f, 0.0f, 1.0f, 0.0f,
                    -0.16f, -1.7f, 0.16f, 1.0f, 1.0f, 0.0f,
                },
                // 前面 (z=0.16)
                new float[]{
                    -0.16f, -1.7f, 0.16f, 0.0f, 1.0f, 0.0f,
                    0.16f, -1.7f, 0.16f, 1.0f, 1.0f, 0.0f,
                    0.16f, 0.2f, 0.16f, 1.0f, 0.0f, 0.0f,
                    -0.16f, -1.7f, 0.16f, 0.0f, 1.0f, 0.0f,
                    0.16f, 0.2f, 0.16f, 1.0f, 0.0f, 0.0f,
                    -0.16f, 0.2f, 0.16f, 0.0f, 0.0f, 0.0f,
                },
                // 后面 (z=-0.16)
                new float[]{
                    0.16f, -1.7f, -0.16f, 0.0f, 1.0f, 0.0f,
                    -0.16f, -1.7f, -0.16f, 1.0f, 1.0f, 0.0f,
                    -0.16f, 0.2f, -0.16f, 1.0f, 0.0f, 0.0f,
                    0.16f, -1.7f, -0.16f, 0.0f, 1.0f, 0.0f,
                    -0.16f, 0.2f, -0.16f, 1.0f, 0.0f, 0.0f,
                    0.16f, 0.2f, -0.16f, 0.0f, 0.0f, 0.0f,
                }
            }
        );
    }
}
